In [1]:
from IPython.core.interactiveshell import InteractiveShell
from IPython.core.display import display, HTML
display(HTML("<style>.container { width:100% !important; }</style>"))
%matplotlib inline 
import matplotlib.pyplot as plt
import pandas as pd

In [2]:
df = pd.read_csv('Amazon.csv')
df.head()

         Date      Open      High       Low     Close  Adj Close    Volume
0  1997-05-15  2.437500  2.500000  1.927083  1.958333   1.958333  72156000
1  1997-05-16  1.968750  1.979167  1.708333  1.729167   1.729167  14700000
2  1997-05-19  1.760417  1.770833  1.625000  1.708333   1.708333   6106800
3  1997-05-20  1.729167  1.750000  1.635417  1.635417   1.635417   5467200
4  1997-05-21  1.635417  1.645833  1.375000  1.427083   1.427083  18853200

In [3]:
type(df.Date[0])

str

In [4]:
df = pd.read_csv('Amazon.csv', parse_dates=["Date"])
df.head()

        Date      Open      High       Low     Close  Adj Close    Volume
0 1997-05-15  2.437500  2.500000  1.927083  1.958333   1.958333  72156000
1 1997-05-16  1.968750  1.979167  1.708333  1.729167   1.729167  14700000
2 1997-05-19  1.760417  1.770833  1.625000  1.708333   1.708333   6106800
3 1997-05-20  1.729167  1.750000  1.635417  1.635417   1.635417   5467200
4 1997-05-21  1.635417  1.645833  1.375000  1.427083   1.427083  18853200

In [5]:
type(df.Date[0])

pandas._libs.tslib.Timestamp

In [6]:
df = pd.read_csv('Amazon.csv', parse_dates=["Date"],index_col="Date")
df.index

DatetimeIndex(['1997-05-15', '1997-05-16', '1997-05-19', '1997-05-20',
               '1997-05-21', '1997-05-22', '1997-05-23', '1997-05-27',
               '1997-05-28', '1997-05-29',
               ...
               '2018-05-15', '2018-05-16', '2018-05-17', '2018-05-18',
               '2018-05-21', '2018-05-22', '2018-05-23', '2018-05-24',
               '2018-05-25', '2018-05-29'],
              dtype='datetime64[ns]', name='Date', length=5294, freq=None)

In [7]:
df["2018-03"].Close.mean()

1540.367629333333

In [9]:
df["2018-05-01":"2018-05-29"]

,Open,High,Low,Close,Adj Close,Volume
Date,,,,,,
2018-05-01,1563.219971,1585.000000,1552.180054,1582.260010,1582.260010,4572100
2018-05-02,1580.979980,1588.500000,1566.359985,1569.680054,1569.680054,4360300
2018-05-03,1560.010010,1574.800049,1546.020020,1572.079956,1572.079956,4251900
2018-05-04,1562.449951,1584.900024,1562.189941,1580.949951,1580.949951,3443600
2018-05-07,1589.339966,1606.949951,1587.829956,1600.140015,1600.140015,3801900
2018-05-08,1595.000000,1596.880005,1582.510010,1592.390015,1592.390015,3067900
2018-05-09,1600.000000,1608.000000,1592.000000,1608.000000,1608.000000,3637300
2018-05-10,1608.479980,1615.599976,1603.439941,1609.079956,1609.079956,2817500
2018-05-11,1610.989990,1611.099976,1597.890015,1602.910034,1602.910034,2263900
2018-05-14,1604.000000,1611.180054,1600.050049,1601.540039,1601.540039,2509500
2018-05-15,1587.800049,1587.800049,1565.219971,1576.119995,1576.119995,5077500
2018-05-16,1577.500000,1594.430054,1576.670044,1587.280029,1587.280029,2570600
2018-05-17,1580.560059,1594.040039,1573.000000,1581.760010,1581.760010,2147600
2018-05-18,1581.329956,1583.589966,1572.099976,1574.369995,1574.369995,2642600
2018-05-21,1585.000000,1592.050049,1575.000000,1585.459961,1585.459961,2925200
2018-05-22,1589.890015,1589.890015,1575.250000,1581.400024,1581.400024,2115600
2018-05-23,1571.050049,1601.859985,1566.339966,1601.859985,1601.859985,3299800
2018-05-24,1598.030029,1608.239990,1588.380005,1603.069946,1603.069946,3430000
2018-05-25,1603.000000,1614.119995,1600.449951,1610.150024,1610.150024,2698400
2018-05-29,1600.709961,1621.790039,1600.150024,1612.869995,1612.869995,3829900

In [10]:
df["2018-05-01":"2018-05-01"]

                   Open    High          Low       Close   Adj Close   Volume
Date
2018-05-01  1563.219971  1585.0  1552.180054  1582.26001  1582.26001  4572100

In [11]:
df.loc["2018-03-01":"2018-03-01"]

                   Open        High     Low        Close    Adj Close   Volume
Date
2018-03-01  1513.599976  1518.48999  1465.0  1493.449951  1493.449951  6835200